src/mp_toir/Documents/мп_НарядНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_НарядНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНарядаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.мп_ЗаданиеНаРемонт</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияДефекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/СтатусыНарядаНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыНарядаНаРемонт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_НарядНаРемонт/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ЗаполнитьОтбор(ПраваДоступа);
	ДоступностьРеквизитов(ПраваДоступа);
	ОтборСписка();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаВыполненияПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.БригадирТОиР Тогда
		СписокОтветственных = СписокОтветственныхПоПодразделению(ЭтотОбъект.ВыбранноеПодразделение);
		Если СписокОтветственных = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МассивЭлементов = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокОтветственных);
		МассивЭлементов.Добавить(НовыйПараметр);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранноеПодразделениеПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйСтатусПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйОтветственныйПриИзменении(Элемент)
	ОтборСписка();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОбменаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = ОбщегоНазначенияКлиент.СтатусыОбменаКлиент(ЭтотОбъект.СтатусОбмена);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.СтатусОбмена.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.СтатусОбмена.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;

	ОтборСписка();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбранныйСтатусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = СтатусыНаряда();
	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.ВыбранныйСтатус.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.ВыбранныйСтатус.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;

	ОтборСписка();

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.СтатусОбмена.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.СтатусОбмена.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСписка();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйСтатусУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.ВыбранныйСтатус.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.ВыбранныйСтатус.Удалить(УдаляемыйЭлемент);
	КонецЦикла;

	ОтборСписка();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранноеПодразделениеОчистка(Элемент, СтандартнаяОбработка)
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.БригадирТОиР Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьПроведениеДокумента(Команда)
	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяОтменаПроведения");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяПометкаУдаления");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПометкаУдаленияОтменаПроведения(ДействиеСДокументом)

	ДокПроведения = ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока;
	РеквизитыДокумента = РеквизитыДокумента(ДокПроведения);
	ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
	СтатусОбмена = РеквизитыДокумента.СтатусОбмена;
	Статус = РеквизитыДокумента.Статус;
	Проведен = РеквизитыДокумента.Проведен;
	Ответственный = РеквизитыДокумента.Ответственный;
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	ОтветственныйПользователь = (ЭтотОбъект.ТекущийПользователь = Ответственный);
	СтатусСоздан = (Статус = ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.Создан"));
	СтатусВРаботе = (Статус = ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.ВРаботе"));
	СтатусВыполнен = (Статус = ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.Выполнен"));
	Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
		Если СтатусВыполнен Тогда
			Возврат;
		ИначеЕсли СтатусВРаботе И ОтветственныйПользователь Тогда
			СтрСообщение = "Работы по данному наряду уже начались. Информация об отмене проведения будет выгружена в КИС,"
				+"но связанные документы не будут изменены. Необходимо будет внести изменения вручную. Продолжить?";
			ПроцедураОповещенияСтр = "ОтменаПроведенияДокументаЧерезВопрос";
			ДопПараметр = Новый Структура;
			ДопПараметр.Вставить("ДокПроведения", ДокПроведения);
			ПроцедураОповещения = Новый ОписаниеОповещения(ПроцедураОповещенияСтр, ЭтотОбъект, ДопПараметр);
			ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
			Возврат;
		Иначе
			Возврат;
		КонецЕсли;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, ДействиеСДокументом);
	ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
		Если СтатусВыполнен Тогда
			Возврат;
		ИначеЕсли СтатусВРаботе И ОтветственныйПользователь Тогда
			СтрСообщение = "Работы по данному наряду уже начались. Информация об установке пометки удаления будет выгружена в КИС,"
				+ "но связанные документы не будут изменены. Необходимо будет внести изменения вручную. Продолжить?";
			ПроцедураОповещенияСтр = "ПометкаУдаленияДокументаЧерезВопрос";
			ДопПараметр = Новый Структура;
			ДопПараметр.Вставить("ДокПроведения", ДокПроведения);
			ПроцедураОповещения = Новый ОписаниеОповещения(ПроцедураОповещенияСтр, ЭтотОбъект, ДопПараметр);
			ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
			Возврат;
		Иначе
			Возврат;
		КонецЕсли;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, ДействиеСДокументом);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведенияДокументаЧерезВопрос(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, "ИнтерактивнаяОтменаПроведения");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаленияДокументаЧерезВопрос(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, "ИнтерактивнаяПометкаУдаления");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПометкаОтменаПроведенияДокументСервер(Знач ДокПроведения, ДействиеСДокументом)
	ДокОбъект = ДокПроведения.ПолучитьОбъект();
	Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
		Действие = Не ДокПроведения.ПометкаУдаления;
		ДокОбъект.УстановитьПометкуУдаления(Действие);
	КонецЕсли;
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыДокумента(ДокПроведения)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПроведения
		, "Статус, ПометкаУдаления, СтатусОбмена, Проведен, Ответственный");
КонецФункции

&НаСервере
Процедура ЗаполнитьОтбор(Знач ПраваДоступа)

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.ВыбранноеПодразделение = РеквизитыКонстант["ПодразделениеПользователя"];
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ЭтотОбъект.Исполнитель = ТекущийПользователь;
	ЭтотОбъект.ВыбранныйСтатус = Перечисления.СтатусыНарядаНаРемонт.Создан;

	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	ЭтотОбъект.ВыбранныйСтатус.Добавить(Перечисления.СтатусыНарядаНаРемонт.Создан);
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("СтатусОбмена", ЭтотОбъект.СтатусОбмена);
	НастройкиПоУмолчанию.Вставить("ВыбранныйСтатус", ЭтотОбъект.ВыбранныйСтатус);

	ПерсональныеНастройки = ОбщегоНазначенияВызовСервера.ПолучитьПерсональныеНастройки(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, НастройкиПоУмолчанию);

	ЭтотОбъект.СтатусОбмена = ПерсональныеНастройки["СтатусОбмена"];
	ЭтотОбъект.ВыбранныйСтатус = ПерсональныеНастройки["ВыбранныйСтатус"];

КонецПроцедуры

&НаСервере
Процедура ДоступностьРеквизитов(Знач ПраваДоступа)

	Если ПраваДоступа.АдминТОиР Или ПраваДоступа.БригадирТОиР Тогда
		ДоступПодразделения = Истина;
		ДоступОтветственный = Истина;
	Иначе
		ДоступПодразделения = Ложь;
		ДоступОтветственный = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВыбранноеПодразделение", "Доступность", ДоступПодразделения);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Ответственный", "Доступность", ДоступОтветственный);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокОтветственныхПоПодразделению(Знач ВыбранноеПодразделение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ответственный
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Подразделение В ИЕРАРХИИ(&ВыбранноеПодразделение)";
	
	Запрос.УстановитьПараметр("ВыбранноеПодразделение", ВыбранноеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ответственный");
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ОтборСписка()

	Список.Параметры.УстановитьЗначениеПараметра("ВыбранноеПодразделение", ЭтотОбъект.ВыбранноеПодразделение);
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", ЭтотОбъект.ДатаВыполнения);
	Список.Параметры.УстановитьЗначениеПараметра("ПлановаяДата", ЭтотОбъект.ПлановаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ЭтотОбъект.Исполнитель);
	Список.Параметры.УстановитьЗначениеПараметра("Статус", ЭтотОбъект.ВыбранныйСтатус);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.ВыбранныйОтветственный);
	
	СтатусыОбменаВЗапрос = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.СтатусОбмена Цикл
		СтатусыОбменаВЗапрос.Добавить(ТекСтатус.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыОбмена", СтатусыОбменаВЗапрос);

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);
		
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "ВыбранныйСтатус", ЭтотОбъект.ВыбранныйСтатус);

КонецПроцедуры

&НаКлиенте
Функция СтатусыНаряда()

	АктуальныеСтатусы = Новый Массив;
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.Создан"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.ВРаботе"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыНарядаНаРемонт.Выполнен"));
		
	СписокВыбора = Новый СписокЗначений;
	Для Каждого СтатусОбменаКлиент Из АктуальныеСтатусы Цикл
		Пометка = ?(ЭтотОбъект.ВыбранныйСтатус.НайтиПоЗначению(СтатусОбменаКлиент) = Неопределено, Ложь, Истина);
		СписокВыбора.Добавить(СтатусОбменаКлиент, , Пометка);
	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

#КонецОбласти
